---
kind: method
id: M:Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent.#ctor(Autodesk.Revit.DB.TriangulatedShellComponent)
source: html/03911501-0b84-1e86-f1cf-5d7af282096d.htm
---
# Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent.#ctor Method

Constructs an interface object for a TriangulatedShellComponent.

## Syntax (C#)
```csharp
public TriangulationInterfaceForTriangulatedShellComponent(
	TriangulatedShellComponent externalTriangulatedShellComponent
)
```

## Parameters
- **externalTriangulatedShellComponent** (`Autodesk.Revit.DB.TriangulatedShellComponent`) - The TriangulatedShellComponent that the interface object represents.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null